/**
 *Java 1.
 *
 *@author Lazarev Alexei
 *@version 16.11.2021
 */

class FirstApp {
    public static void main(String[] args) {
        // для вызова метода необходимо передать ему 2 аргумента типа int,
        // результатом работы будет целое число, которое напечатается в консоль
        //System.out.println(summ(5, 5));

        // для вызова метода ему не нужно передавать аргументы,
        // и он не возвращает данные (метод объявлен как void)
        //printSomeText();

        // для вызова метода передаем ему в качестве аргумента строку "Java",
        // которую он выведет в консоль
        //printMyText("Java");
    }
}
